import { LocalisationObject } from '@/types/localisationTypes'

export const ru: LocalisationObject = {
  requestLang: 'ru-RU',
  homePage: {
    title: 'Добро пожаловать в MovieBox',
    subtitle: 'Миллионы фильмов, сериалов и людей. Исследуйте сейчас.'
  },
  about: {
    title: 'O MovieBox',
    text: `Добро пожаловать в наш каталог фильмов! Здесь вы найдете обширную коллекцию фильмов различных жанров, от новинок кинопроката до бессмертных классиков. Если вам хочется увидеть захватывающее приключение, трогательную драму или напряженный триллер, у нас есть фильм для каждого. На нашей платформе вы найдете подробную информацию о каждом фильме, включая краткие описания сюжета, состав актеров и съемочной группы, а также рейтинги пользователей, что поможет вам выбрать именно тот фильм, который вам подходит. Мы регулярно обновляем каталог, добавляя новые релизы и скрытые кинематографические жемчужины, чтобы вам не приходилось искать фильмы в других местах. Вы можете фильтровать поиск по жанрам, году выпуска, рейтингу и многим другим параметрам, что значительно упростит поиск. Наш каталог удобен как для случайных зрителей, так и для настоящих киноманов, предлагая отличное качество просмотра и удобство в использовании. Приятного просмотра и новых кинематографических открытий!`,
  }
}